YellowCollectorClient/src/Catalogs/МаршрутыYellowCollector/МаршрутыYellowCollector.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МаршрутыYellowCollector</name>
  <predefined>
    <items>
      <name>Ping</name>
      <description>Ping</description>
    </items>
    <items>
      <name>V1_BaseAggregation</name>
      <description>V1 base aggregation</description>
    </items>
    <items>
      <name>V1_BaseAggregationMapping</name>
      <description>V1 base aggregation mapping</description>
    </items>
    <items>
      <name>V1_ErrorDetails</name>
      <description>V1 error details</description>
    </items>
    <items>
      <name>V1_ErrorListMapping</name>
      <description>V1 error list mapping</description>
    </items>
    <items>
      <name>V1_ErrorList</name>
      <description>V1. Список ошибок</description>
    </items>
    <items>
      <name>V2_ErrorMarkedForDeletion</name>
      <description>V2 error marked for deletion</description>
    </items>
  </predefined>
  <attributes>
    <name>АдресРесурса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

YellowCollectorClient/src/CommonModules/YellowCollectorЗапросы/Module.bsl
// @strict-types

#Область ПрограммныйИнтерфейс

// Сервер доступен.
// 
// Возвращаемое значение:
//  Булево - Сервер доступен
Функция СерверДоступен() Экспорт
	
	СерверДоступен = Истина;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	
	ДополнительныеПараметры = Новый Структура("Заголовки", Заголовки);
	
	Попытка
		КоннекторHTTP.Get(URlДляПроверкиДоступностиСервера(), Неопределено, ДополнительныеПараметры);
	Исключение
		СерверДоступен = Ложь;
	КонецПопытки;
	
	Возврат СерверДоступен;
	
КонецФункции

// Получить заголовки всех отчетов об ошибках по параметрам.
// 
// Возвращаемое значение:
//  Соответствие, Структура - Получить заголовки всех отчетов об ошибках по параметрам
Функция ПолучитьЗаголовкиВсехОтчетовОбОшибкахПоПараметрам(Знач Параметры = Неопределено) Экспорт
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	
	ПараметрыЗапроса = Новый Структура("from, to", ТекущаяДатаСеанса()- 3600*24000, ТекущаяДатаСеанса());
	ДополнительныеПараметры = Новый Структура("Заголовки", Заголовки);
	
	Возврат КоннекторHTTP.PostJson(URlДляПолученияСпискаОшибок(), ПараметрыЗапроса, ДополнительныеПараметры);
	
КонецФункции

// Получить маппинг полей
// 
// Возвращаемое значение:
//  Соответствие, Структура - Получить заголовки всех отчетов об ошибках по параметрам
Функция ПолучитьМаппингПолейЗапросаПолученияСпискаОшибок() Экспорт
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	
	ДополнительныеПараметры = Новый Структура("Заголовки", Заголовки);
	
	Возврат КоннекторHTTP.PostJson(URlДляПолученияМаппингаПолейЗапросаПолученияСпискаОшибок(), 
	                               Новый Структура, 
	                               ДополнительныеПараметры);
	
КонецФункции


// Получить детали отчета об ошибке по ИД.
// 
// Параметры:
//  ИД - Строка - 
// 
// Возвращаемое значение:
//  Соответствие, Структура - 
Функция ПолучитьДеталиОтчетаОбОшибкеПоИД(ИД) Экспорт
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	
	Возврат КоннекторHTTP.PostJson(URLДляПолученияДеталейОтчетаОбОшибках(ИД), Новый Структура);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЗапросник() Экспорт
	Возврат Обработки.ЗапросникYellowCollector.Создать();
КонецФункции

#Область ФормированиеURL

// Url для получения списка ошибок.
// 
// Возвращаемое значение:
//  Строка - 
Функция URlДляПолученияМаппингаПолейЗапросаПолученияСпискаОшибок()
	
	Возврат ПолучитьЗапросник()
	        .УстановитьМаршрут(Справочники.МаршрутыYellowCollector.V1_ErrorListMapping)
	        .Иницизировать()
	        .СформироватьURL();
	
КонецФункции

// Url для получения списка ошибок.
// 
// Возвращаемое значение:
//  Строка - 
Функция URlДляПолученияСпискаОшибок()
	
	Возврат ПолучитьЗапросник()
	        .УстановитьМаршрут(Справочники.МаршрутыYellowCollector.V1_ErrorList)
	        .Иницизировать()
	        .СформироватьURL();
	
КонецФункции

// Url для проверки доступности сервера.
// 
// Возвращаемое значение:
//  Строка -
Функция URlДляПроверкиДоступностиСервера()
	
	Возврат ПолучитьЗапросник()
	        .УстановитьМаршрут(Справочники.МаршрутыYellowCollector.Ping)
	        .Иницизировать()
	        .СформироватьURL();
	
КонецФункции

// Url для детальной информации отчета об ошибках
// 
// Возвращаемое значение:
//  Строка -
Функция URLДляПолученияДеталейОтчетаОбОшибках(ИД)
	
	Параметры = Новый Структура;
	Параметры.Вставить("ИД", ИД);
	
	Возврат ПолучитьЗапросник()
	        .УстановитьМаршрут(Справочники.МаршрутыYellowCollector.V1_ErrorDetails)
	        .Иницизировать(Параметры)
	        .СформироватьURL();
	        
КонецФункции

#КонецОбласти

#КонецОбласти
